[
  {
    "id": "council-constance",
    "name": "Council of Constance",
    "startYear": 1414,
    "endYear": 1418,
    "type": "council",
    "locationId": "constance",
    "wikipediaUrl": "https://en.wikipedia.org/wiki/Council_of_Constance",
    "newAdventUrl": "https://www.newadvent.org/cathen/04288a.htm",
    "summary": "The Council of Constance was convened to resolve the Western Schism, which had divided the Church with three competing popes. The council successfully ended the schism by deposing all three popes and electing Martin V as the single legitimate pope. The council also condemned the teachings of John Wycliffe and Jan Hus, leading to Hus's execution. It declared that ecumenical councils have authority over the pope.",
    "keyDocuments": [
      "Haec Sancta",
      "Frequens"
    ]
  },
  {
    "id": "end-western-schism",
    "name": "End of the Western Schism",
    "startYear": 1417,
    "endYear": 1417,
    "type": "schism",
    "locationId": "constance",
    "wikipediaUrl": "https://en.wikipedia.org/wiki/Western_Schism",
    "newAdventUrl": "https://www.newadvent.org/cathen/13539a.htm",
    "summary": "The Western Schism, which began in 1378, was finally resolved at the Council of Constance in 1417 with the election of Pope Martin V. For nearly 40 years, the Church had been divided with multiple claimants to the papacy, causing confusion and weakening papal authority. The resolution restored unity to the Western Church.",
    "keyDocuments": []
  },
  {
    "id": "martyrdom-jan-hus",
    "name": "Martyrdom of Jan Hus",
    "startYear": 1415,
    "endYear": 1415,
    "type": "persecution",
    "locationId": "constance",
    "wikipediaUrl": "https://en.wikipedia.org/wiki/Jan_Hus",
    "newAdventUrl": "https://www.newadvent.org/cathen/07584b.htm",
    "summary": "Jan Hus, a Czech reformer and theologian, was burned at the stake as a heretic at the Council of Constance in 1415. Hus had criticized Church corruption and advocated for reforms, drawing on the ideas of John Wycliffe. His execution sparked the Hussite Wars in Bohemia and made him a national hero and martyr in Czech lands.",
    "keyDocuments": []
  },
  {
    "id": "council-florence",
    "name": "Council of Florence",
    "startYear": 1431,
    "endYear": 1449,
    "type": "council",
    "locationId": "florence",
    "wikipediaUrl": "https://en.wikipedia.org/wiki/Council_of_Florence",
    "newAdventUrl": "https://www.newadvent.org/cathen/06107a.htm",
    "summary": "The Council of Florence (also called the Council of Basel-Ferrara-Florence) was convened to address the reunion of the Eastern and Western Churches. The council achieved a temporary reunion with the Byzantine Church through the Decree of Union, though this was later repudiated by the Eastern Church. The council also addressed various reforms and theological issues.",
    "keyDocuments": [
      "Decree of Union (Laetentur Caeli)"
    ]
  },
  {
    "id": "fall-constantinople",
    "name": "Fall of Constantinople",
    "startYear": 1453,
    "endYear": 1453,
    "type": "other",
    "locationId": "constantinople",
    "wikipediaUrl": "https://en.wikipedia.org/wiki/Fall_of_Constantinople",
    "newAdventUrl": "https://www.newadvent.org/cathen/04301a.htm",
    "summary": "The Fall of Constantinople to the Ottoman Turks in 1453 marked the end of the Byzantine Empire and had profound consequences for Christianity. The city had been the center of Eastern Christianity for over a thousand years. The fall led to the migration of Greek scholars to the West, contributing to the Renaissance, and permanently changed the balance of power between Christianity and Islam.",
    "keyDocuments": []
  },
  {
    "id": "spanish-inquisition",
    "name": "Spanish Inquisition",
    "startYear": 1478,
    "endYear": 1834,
    "type": "persecution",
    "locationId": "spain",
    "wikipediaUrl": "https://en.wikipedia.org/wiki/Spanish_Inquisition",
    "newAdventUrl": "https://www.newadvent.org/cathen/08026a.htm",
    "summary": "The Spanish Inquisition was established in 1478 by Catholic Monarchs Ferdinand II of Aragon and Isabella I of Castile, with papal approval. Initially intended to ensure the orthodoxy of converted Jews and Muslims, it became notorious for its harsh methods and widespread use of torture. The Inquisition had a profound impact on Spanish society and culture for centuries.",
    "keyDocuments": []
  },
  {
    "id": "reconquista-completion",
    "name": "Completion of the Reconquista",
    "startYear": 1492,
    "endYear": 1492,
    "type": "other",
    "locationId": "granada",
    "wikipediaUrl": "https://en.wikipedia.org/wiki/Reconquista",
    "newAdventUrl": "https://www.newadvent.org/cathen/12733a.htm",
    "summary": "The Reconquista, the centuries-long Christian reconquest of the Iberian Peninsula from Muslim rule, was completed in 1492 with the fall of Granada, the last Muslim stronghold in Spain. This victory by the Catholic Monarchs Ferdinand and Isabella marked the end of Muslim political power in Western Europe and had significant religious and cultural consequences.",
    "keyDocuments": []
  },
  {
    "id": "discovery-americas",
    "name": "Discovery of the Americas",
    "startYear": 1492,
    "endYear": 1492,
    "type": "other",
    "locationId": "spain",
    "wikipediaUrl": "https://en.wikipedia.org/wiki/Christopher_Columbus",
    "newAdventUrl": "https://www.newadvent.org/cathen/04140a.htm",
    "summary": "Christopher Columbus's voyage to the Americas in 1492, sponsored by the Catholic Monarchs of Spain, opened a new era of European exploration and colonization. This discovery would lead to the spread of Christianity to the New World, though it also brought conflict, disease, and exploitation to indigenous peoples. The Church would play a central role in the evangelization of the Americas.",
    "keyDocuments": []
  },
  {
    "id": "printing-press",
    "name": "Invention of the Printing Press",
    "startYear": 1450,
    "endYear": 1450,
    "type": "other",
    "locationId": "mainz",
    "wikipediaUrl": "https://en.wikipedia.org/wiki/Printing_press",
    "newAdventUrl": "https://www.newadvent.org/cathen/12420a.htm",
    "summary": "Johannes Gutenberg's invention of the movable-type printing press around 1450 revolutionized the spread of information and had profound effects on the Church. The printing press made the Bible and other religious texts more widely available, contributing to both Catholic reform movements and later Protestant challenges to Church authority. The Gutenberg Bible was the first major book printed in Europe.",
    "keyDocuments": []
  },
  {
    "id": "savonarola-florence",
    "name": "Savonarola's Reform Movement in Florence",
    "startYear": 1494,
    "endYear": 1498,
    "type": "reform",
    "locationId": "florence",
    "wikipediaUrl": "https://en.wikipedia.org/wiki/Girolamo_Savonarola",
    "newAdventUrl": "https://www.newadvent.org/cathen/13490a.htm",
    "summary": "Girolamo Savonarola, a Dominican friar, led a moral and religious reform movement in Florence from 1494 to 1498. He criticized the corruption of the Church and the Medici family, calling for repentance and reform. His influence led to the 'Bonfire of the Vanities' where luxury items were burned. However, he was eventually excommunicated and executed by the authorities.",
    "keyDocuments": []
  }
]

