[
  {
    "id": "unam-sanctam",
    "name": "Unam Sanctam",
    "startYear": 1302,
    "endYear": 1302,
    "type": "other",
    "locationId": "rome",
    "wikipediaUrl": "https://en.wikipedia.org/wiki/Unam_sanctam",
    "newAdventUrl": "https://www.newadvent.org/cathen/15126a.htm",
    "summary": "Unam Sanctam was a papal bull issued by Pope Boniface VIII in 1302, one of the most extreme statements of papal authority in history. It asserted that both spiritual and temporal power are subject to the pope, and that submission to the Roman pontiff is necessary for salvation. The bull was issued during Boniface's conflict with King Philip IV of France and represents the high point of medieval papal claims to universal authority.",
    "keyDocuments": [
      "Unam Sanctam"
    ]
  },
  {
    "id": "avignon-papacy",
    "name": "Avignon Papacy (Babylonian Captivity)",
    "startYear": 1309,
    "endYear": 1377,
    "type": "other",
    "locationId": "lyons",
    "wikipediaUrl": "https://en.wikipedia.org/wiki/Avignon_Papacy",
    "newAdventUrl": "https://www.newadvent.org/cathen/02158a.htm",
    "summary": "The Avignon Papacy, also known as the Babylonian Captivity, was the period from 1309 to 1377 when seven consecutive popes resided in Avignon, France, rather than Rome. This period began under Pope Clement V, who moved the papal court to Avignon under pressure from the French king. The period saw the papacy fall under French influence and led to widespread criticism and calls for reform. The papacy was finally returned to Rome by Pope Gregory XI.",
    "keyDocuments": []
  },
  {
    "id": "council-vienne",
    "name": "Council of Vienne",
    "startYear": 1311,
    "endYear": 1312,
    "type": "council",
    "locationId": "lyons",
    "wikipediaUrl": "https://en.wikipedia.org/wiki/Council_of_Vienne",
    "newAdventUrl": "https://www.newadvent.org/cathen/15419a.htm",
    "summary": "The Council of Vienne was an ecumenical council convened by Pope Clement V in 1311-1312. The council suppressed the Knights Templar, whose order had been dissolved by the pope under pressure from King Philip IV of France. The council also addressed the status of the Franciscan Spirituals and various disciplinary matters. It was the first ecumenical council held outside Italy or Constantinople.",
    "keyDocuments": [
      "Suppression of the Knights Templar",
      "Decrees on Franciscan Poverty"
    ]
  },
  {
    "id": "dissolution-templars",
    "name": "Dissolution of the Knights Templar",
    "startYear": 1312,
    "endYear": 1312,
    "type": "other",
    "locationId": "lyons",
    "wikipediaUrl": "https://en.wikipedia.org/wiki/Knights_Templar",
    "newAdventUrl": "https://www.newadvent.org/cathen/14493a.htm",
    "summary": "The Knights Templar, a powerful military and financial order, were suppressed by Pope Clement V at the Council of Vienne in 1312. The suppression came after years of persecution by King Philip IV of France, who accused the order of heresy and immorality. The Templars' assets were transferred to the Knights Hospitaller, though much was seized by secular rulers. The last Grand Master, Jacques de Molay, was burned at the stake in 1314.",
    "keyDocuments": []
  },
  {
    "id": "black-death",
    "name": "Black Death",
    "startYear": 1347,
    "endYear": 1351,
    "type": "other",
    "locationId": "rome",
    "wikipediaUrl": "https://en.wikipedia.org/wiki/Black_Death",
    "newAdventUrl": "https://www.newadvent.org/cathen/02425a.htm",
    "summary": "The Black Death was one of the most devastating pandemics in human history, killing an estimated 30-60% of Europe's population between 1347 and 1351. The plague had profound effects on the Church, killing many clergy and leading to changes in religious practice. Flagellant movements arose, and many blamed the plague on God's wrath, leading to persecution of Jews and other minorities. The Church struggled to respond to the crisis, with many questioning why God would allow such suffering.",
    "keyDocuments": []
  },
  {
    "id": "western-schism",
    "name": "Western Schism (Great Schism)",
    "startYear": 1378,
    "endYear": 1417,
    "type": "schism",
    "locationId": "rome",
    "wikipediaUrl": "https://en.wikipedia.org/wiki/Western_Schism",
    "newAdventUrl": "https://www.newadvent.org/cathen/13539a.htm",
    "summary": "The Western Schism, also known as the Great Schism or Papal Schism, was a split within the Catholic Church from 1378 to 1417 when multiple men simultaneously claimed to be the true pope. It began with the election of Urban VI in Rome, followed by the election of Clement VII in Avignon by cardinals who disputed Urban's election. At one point, there were even three rival popes. The schism deeply divided Western Christendom and damaged the credibility of the papacy. It was finally resolved by the Council of Constance.",
    "keyDocuments": []
  },
  {
    "id": "hundred-years-war",
    "name": "Hundred Years' War",
    "startYear": 1337,
    "endYear": 1453,
    "type": "other",
    "locationId": "rome",
    "wikipediaUrl": "https://en.wikipedia.org/wiki/Hundred_Years%27_War",
    "newAdventUrl": "https://www.newadvent.org/cathen/07558a.htm",
    "summary": "The Hundred Years' War was a series of conflicts between England and France from 1337 to 1453. The war had significant implications for the Church, as both sides sought papal support, and the conflict complicated the already divisive Western Schism. Popes attempted to mediate peace, and the war affected relations between the English and French Churches. The war contributed to the weakening of feudalism and the rise of nation-states.",
    "keyDocuments": []
  }
]

